Revit 2027 API
ConductorSize Properties
The ConductorSize type exposes the following members.
Properties
Name | Description
Diameter |  The diameter of the conductor.
Id |  The Conductor Size id.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The Conductor Size name.
Top
See Also
Reference
ConductorSize Class
Autodesk.Revit.DB.Electrical Namespace